/*eslint-disable*/

export const REGEX = {
    ID_regex: '^[a-zA-Z0-9-_]{6,20}$',
    Nickname_regex : '^[a-zA-Z가-힣0-9\_]{3,20}$',
    Email_regex : "^[a-z0-9\!\#\$\%\&\'\*\+\/\=\?\^\_\`\{\|\}\~\-]+(?:.[a-z0-9\!\#\$\%\&\'\*\+\/\=\?\^\_\`\{\|\}\~\-\]\+])*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?)+[\.]{1}[a-z0-9](?:[a-z0-9-]*[a-z0-9])?$",
    Password_regex: '^(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])[a-zA-Z0-9\~\!\@\#\$\^\*\_\+]{8,}$|^(?=.*[A-Z])(?=.*[a-z])(?=.*[\~\!\@\#\$\^\*\_\+])[a-zA-Z0-9\~\!\@\#\$\^\*\_\+]{8,}$|^(?=.*[a-z])(?=.*[0-9])(?=.*[\~\!\@\#\$\^\*\_\+])[a-zA-Z0-9\~\!\@\#\$\^\*\_\+]{8,}$|^(?=.*[A-Z])(?=.*[0-9])(?=.*[\~\!\@\#\$\^\*\_\+])[a-zA-Z0-9\~\!\@\#\$\^\*\_\+]{8,}$|^(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?=.*[\~\!\@\#\$\^\*\_\+])[a-zA-Z0-9\~\!\@\#\$\^\*\_\+]{8,}$'
}

export const REGEX_MESSAGE = {
    ID_message : "6-20자 길이의 영대소문자와 숫자와 특수기호 '-', '_' 조합으로만 사용가능합니다.",
    Password_check_message : "입력한 패스워드와 다릅니다.",
    Nickname_message : "3-20자 길이의 영어 대소문자, 숫자, 한글, 특수기호(_) 조합으로만 사용가능합니다.",
    Email_message : "'@' 문자를 포함한 이메일을 입력해주세요."
}
